

	"NSLE-20639 -108" = "Viimeistä komentoa ei voitu suorittaa loppuun, koska muistia ei ole riittävästi.";
	"NSLE-20639 -108 Solution" = "Vapauta muistia lopettamalla joitain ohjelmia ja sulkemalla ikkunoita.";

	"NSLE-20639 -1" = "Pyyntöä ei voitu suorittaa loppuun, koska NSL-palvelimissa tapahtui sisäinen virhe.";
	"NSLE-20639 -1 Solution" = "Yritä uudelleen. Mikäli ongelmat jatkuvat, käynnistä ohjelma tai tietokone uudelleen ja yritä pyyntöä uudelleen.";

	"NSLE-20639 -4199" = "NSL Manageria ei voitu käynnistää.";
	"NSLE-20639 -4199 Solution" = "Käynnistä tietokone uudelleen ja yritä uudelleen.";

	"NSLE-20639 -4198" = "Asennettu järjestelmä ei tue tätä NSL-versiota.";
	"NSLE-20639 -4198 Solution" = "Asenna Mac OS 8.7 tai uudempi.";

	"NSLE-20639 -4197" = "Open Transportin oikea versio ei ole käytettävissä.";
	"NSLE-20639 -4197 Solution" = "Asenna Open Transport versio 1.3 tai uudempi.";

	"NSLE-20639 -4192" = "Tietokoneesi ei ole yhteydessä verkkoon.";
	"NSLE-20639 -4192 Solution" = "Tarkista verkkoasetukset ja varmista, että kaikki verkkokaapelit on kytketty oikein. Yritä sitten pyyntöä uudelleen.";

	"NSLE-20639 -4182" = "NSL-plugineja ei voida ladata käynnistyksen aikana.";
	"NSLE-20639 -4182 Solution" = "Käynnistä tietokone uudelleen ja yritä pyyntöä uudelleen.";

	"NSLE-20639 -4181" = "NSL Manager ei löytänyt ladattavia plugineja.";
	"NSLE-20639 -4181 Solution" = "Varmista että sinulla on vähintään yksi NSL-plugin /System/Library/Frameworks/NSLCore.framework/Resources/NSLPlugins-kansiossa.";

	"NSLE-20639 -4179" = "NSL Manager ei ei voinut ladata yhtään pluginia käsittelemään pyyntöäsi.";
	"NSLE-20639 -4179 Solution" = "Tarkista verkkoasetukset ja varmista, että kaikki verkkokaapelit on kytketty oikein. Yritä sitten pyyntöä uudelleen.";

	"NSLE-20639 -4177" = "Joidenkin (ei kaikkien) NSL-pluginien lataaminen epäonnistui.";
	"NSLE-20639 -4177 Solution" = "Voit jatkaa, koska vähintään yksi plugin on käytettävissä. Käytettävissä olevan pluginin näkee Laajennusten hallinta -säätimestä.";

	"NSLE-20639 -4174" = "NSL UI Library ei ole käytettävissä.";
	"NSLE-20639 -4174 Solution" = "Varmista että jaettu kirjasto on Extensions-kansiossa (Laajennukset) ja yritä uudelleen.";

	"NSLE-20639 -43" = "Toimintoon tarvittava tiedosto ei ollut käytettävissä.";
	"NSLE-20639 -43 Solution" = "Varmista, että olet asentanut kaikki komponentit oikein.";

	"STR#-20639 1" = "NSL-pluginia %s ei voitu ladata.";

	"STR#-20639 2" = "Varmista, että verkkoasetukset on tehty oikein. Voit jatkaa, koska vähintään yksi plugin on käytettävissä.";

	"This Computer" = "Tämä tietokone";
	"Managed Network Directory" = "Hallittu verkkohakemisto";
	"Default (%@ and %@)" = "Oletus (%@ ja %@)";
	".Mac" = ".Mac";
	
	"Server" = "Palvelin";
	"My Mac" = "Oma Mac";
	"Folder" = "Kansio";
	"Neighborhood" = "Naapurusto";
	"Mac Server" = "Mac-palvelin";
	"PC Server" = "PC-palvelin";
	"Sharepoint" = "Jakopiste";
	"Remote Disc" = "Etälevy";
	"AirPort Base Station" = "AirPort-tukiasema";
	"AirPort Disk" = "AirPort-levy";
	"AirPort" = "AirPort";
	"Volume" = "Taltio";

	"Applications" = "Ohjelmat";
	"Library" = "Kirjasto";
	"Servers" = "Palvelimet";

	"Guest" = "Vieras";
	"Anonymous" = "Anonyymi";

	"SHARED" = "JAETTU";
	"Network" = "Verkko";
	"More..." = "Lisää…";
	"All..." = "Kaikki…";
	